# Exercise 2 - Database Access

In this exercise we are going to practice accessing RDBMS database using Python.

Create a connection to SQLite sales database (e.g. 'sales.db')

In [1]:
import sqlite3
conn = sqlite3.connect('sales.db')
print(conn)

<sqlite3.Connection object at 0x00000205D875F1F0>

Create a table called *salesman* with the following structure

| column      | type |             |
|-------------|------|-------------|
| salesman_id | text | primary key |
| name        | text |             |
| city        | text |             |
| commision   | real |             |

In [2]:
# Create table
conn.execute('''CREATE TABLE salesman
             (salesman_id text primary key, name text, city text, commission real)''')

Populate *salesman* table with the following data:

| salesman_id | name       | city     | commission |
|-------------|------------|----------|------------|
| 5001        | James Hoog | New York | 0.15       |
| 5002        | Nail Knite | Paris    | 0.13       |
| 5005        | Pit Alex   | London   | 0.11       |
| 5006        | Mc Lyon    | Paris    | 0.14       |
| 5003        | Lauson Hen | <na   >  | 0.12       |
| 5007        | Paul Adam  | Rome     | 0.13       |

In [3]:
salesman = [('5001', 'James Hoog', 'New York', 0.15),
            ('5002', 'Nail Knite', 'Paris', 0.13),
            ('5005', 'Pit Alex', 'London', 0.11),
            ('5006', 'Mc Lyon', 'Paris', 0.14),
            ('5003', 'Lauson Hen', None, 0.12),
            ('5007', 'Paul Adam', 'Rome', 0.13),
            ]
conn.executemany('INSERT INTO salesman VALUES (?,?,?,?)', salesman)

Write a SQL statement to display all the information of all salesmen.

In [4]:
for row in conn.execute('SELECT * FROM salesman'):
    print(row)

('5001', 'James Hoog', 'New York', 0.15)
('5002', 'Nail Knite', 'Paris', 0.13)
('5005', 'Pit Alex', 'London', 0.11)
('5006', 'Mc Lyon', 'Paris', 0.14)
('5003', 'Lauson Hen', None, 0.12)
('5007', 'Paul Adam', 'Rome', 0.13)

Write an SQL statement to display the names of all salesmen with above average commission

In [5]:
for row in conn.execute('SELECT * FROM salesman where commission > (select avg(commission) from salesman)'):
    print(row)

('5001', 'James Hoog', 'New York', 0.15)
('5006', 'Mc Lyon', 'Paris', 0.14)

Increase the commission for all salesmen in Paris by 2% (additional 0.02)

In [6]:
# Create table
conn.execute('''UPDATE salesman 
                SET commission = commission + 0.02
                WHERE city='Paris'  ''')

Create customer table

| Column Name | Type    |             |
|-------------|---------|-------------|
| customer_id | text    | primary key |
| cust_name   | text    |             |
| city        | text    |             |
| grade       | integer |             |
| salesman_id | text    | foreign key |

In [7]:
# Create table
conn.execute('''CREATE TABLE customer
             (customer_id text primary key, cust_name text, city text, grade integer, 
             salesman_id text, foreign key(salesman_id) references salesman(salesman_id) )''')

Populate customer table with the following information

| customer_id | cust_name    | city       | grade | salesman_id |
|-------------|--------------|------------|-------|-------------|
| 3002        | Nick Rimando | New York   | 100   | 5001        |
| 3005        | Graham Zusi  | California | 200   | 5002        |
| 3001        | Brad Guzan   | London     | 100   | 5005        |
| 3004        | Fabian Johns | Paris      | 300   | 5006        |
| 3007        | Brad Davis   | New York   | 200   | 5001        |
| 3009        | Geoff Camero | Berlin     | 100   | 5003        |
| 3008        | Julian Green | London     | 300   | 5002        |
| 3003        | Jozy Altidor | Moscow     | 200   | 5007        |

In [8]:
customers = [('3002', 'Nick Rimando', 'New York', 100, 5001),
            ('3005', 'Graham Zusi', 'California', 200, 5002),
            ('3001', 'Brad Guzan', 'London', 100, 5005),
            ('3004', 'Fabian Johns', 'Paris', 300, 5006),
            ('3007', 'Brad Davis', 'New York', 200, 5001),
            ('3009', 'Geoff Camero', 'Berlin', 100, 5003),
            ('3008', 'Julian Green', 'London', 300, 5002),
            ('3003', 'Jozy Altidor', 'Moscow', 200, 5007), 
            ]
conn.executemany('INSERT INTO customer VALUES (?,?,?,?,?)', customers)

Write a SQL statement to display all the information for those customers with a grade of 200.

In [9]:
for row in conn.execute('SELECT * FROM customer WHERE grade=200'):
    print(row)

('3005', 'Graham Zusi', 'California', 200, '5002')
('3007', 'Brad Davis', 'New York', 200, '5001')
('3003', 'Jozy Altidor', 'Moscow', 200, '5007')

Write an SQL statement to display the customer name, salesman and the city for customers with a grade of 200 and above.

In [10]:
for row in conn.execute('''SELECT c.cust_name, s.name, s.city 
                        FROM customer c, salesman s
                        WHERE c.grade>=200 
                        AND c.salesman_id = s.salesman_id'''):
    print(row)

('Graham Zusi', 'Nail Knite', 'Paris')
('Fabian Johns', 'Mc Lyon', 'Paris')
('Brad Davis', 'James Hoog', 'New York')
('Julian Green', 'Nail Knite', 'Paris')
('Jozy Altidor', 'Paul Adam', 'Rome')

Don't forget to close the connection!

In [11]:
conn.close()